Repository: mozilla-l10n/mt-training-data
Catalog: mcn/mcn_pontoon.tmx
Source language: en_us
Languages: mcn

source: 1 sentence collected
mcn: Dida ta tabaida

source: 2 down, keep it up!<playIcon></playIcon>
mcn: Hini mah ! <playlcon></playlcon> Liguit lō

source: About
mcn: Ki ma

source: Accepted file types: .tsv only
mcn: Slena ma numa yohoma :tsv dèra

source: { $actionType }<playIcon></playIcon> did they accurately speak the sentence?
mcn: { $actionType } <playIcon></playIcon>Na dum gnaha ?

source: { $actionType }<recordIcon></recordIcon> then read the sentence aloud
mcn: { $actionType } <recordIcon></recordIcon> Law go gnolo.

source: { $actionType }<stopIcon></stopIcon> when done
mcn: { $actionType } <stopIcon></stopIcon> Vadeya.

source: { $actionType } submit when ready
mcn: { $actionType } Vulgi la nigi vadeya.

source: Add and Review Sentences, Add Questions, Transcribe Audio
mcn: Vulumu, hugit dida, vulgi nigi aza djoboma, dōma ma delha

source: Add <icon></icon> a public domain sentence
mcn: Vulgi <icon></icon> dida ma sumun wum nongkaf na

source: Add information
mcn: Vulgi slena maraha.

source: Add new sentences for the community to read
mcn: Vulgi dida ta wilida hai djafna

source: Add one sentence per line
mcn: Vulgi dida hai nè nè da

source: Add questions in your language
mcn: Vulgi ma nigi asa djoboma zi vuna vigia

source: Add Sentences
mcn: Vulgi dida

source: Add sentences in your language
mcn: Vulgu dida zi vuna vigia

source: Add up to 1,000 sentences
mcn: Vulgi ha 1000 dida

source: Add Your Voice
mcn: Vulang delha vagnū

source: Agriculture and Food
mcn: Slena ma pìna

source: All sentence must have the same domain
mcn: Li ala dida ki tuamu

source: All sentences must have the same citation
mcn: Li ala dida ki tuamu hai ma sumun dumu

source: Already have an account? <login>Log-In</login>
mcn: Nang asa tabang tuangnu ?<login>tabang tuangnu</login>

source: An error occurred fetching sentences
mcn: Law ka hai dida nem min sluma.

source: An error occurred reviewing this sentence
mcn: Law ka hai dida.

source: An error occurred submitting your voice information
mcn: Slena mè tudi gnadi hai hodoma.

source: Approve
mcn: Awa da

source: A quiet background hubbub is OK, but we don’t want additional voices that may cause a machine algorithm to identify words that are not in the written text. If you can hear distinct words apart from those of the text, the clip should be rejected. Typically this happens where the TV has been left on, or where there is a conversation going on nearby.
mcn: Hingi ma sumza ka bakna , numa mè min ala delha maraha hai vada redeng zi bàmal la nala hinimu

source: Are you coming? <strong>[called by another]</strong>
mcn: Ka tchoysa?<strong>[vul delha maraha]</strong>

source: Ask us questions on <matrixLink>Matrix</matrixLink>, <discourseLink>Discourse</discourseLink> or <emailLink>email</emailLink>.
mcn: Djob ma nang minima zi <matrixLink>Matrix</matrixLink>,<discourseLink>Ma duma</discourseLink> <emailLink> zi vat ta hot dida zi bama</emailLink>.

source: Automotive and Transport
mcn: Kégéna

source: Background Noise
mcn: Slena ma li delhem gnolo

source: Background Voices
mcn: Delha ma gnorna

source: Be cautious before rejecting a clip on the ground that the reader has mispronounced a word, has put the stress in the wrong place, or has apparently ignored a question mark. There are a wide variety of pronunciations in use around the world, some of which you may not have heard in your local community. Please provide a margin of appreciation for those who may speak differently from you.
mcn: Nigi li gnali ala nigi mè mindi ala sumza ma uhumu mè dum gnadi did ken ka’a gnolo hai djafna nongkaf na nang bè hum hai djafna vangnu.hin sumza asa dum ki fangnadi

source: [‘Beret’ is OK whether with stress on the first syllable (UK) or the second (US)]
mcn: Dida ta "slena" doy gnaha ni humum "chose" (FR) "slena" (MA)

source: <bold>{ $count }</bold> Clips
mcn: <bold>{ $count }</bold> nèdè

source: <bold>Help us</bold> find more voices
mcn: <bold>Gudmaha </bold>numa fi delha mara lō

source: Bulk batch
mcn: Ma gnola

source: Bulk Sentences Uploaded
mcn: Dida ta tchoya

source: By telling us about yourself, you will help developers build more inclusive technology
mcn: Nigi min vulma ?

source: By using Common Voice, you agree to our <termsLink>Terms</termsLink> and <privacyLink>Privacy Notice</privacyLink>
mcn: Lā nang ka zi Common voice, nang zi mina vangnu <termsLink> ma lūma</termsLink> zi fūma’na <privacyLink> slen nongkaf.</privacyLink>

source: Cancel Re-recording
mcn: Hin tapna.

source: Cancel Submission
mcn: Hinimu.

source: Cannot submit more than 1000 sentences
mcn: Nigi mè asa vul ha 1000 dida di

source: Change preferences
mcn: Midgi ma nigui minima

source: Check <icon></icon> is this a linguistically correct sentence?
mcn: Duaida <icon></icon> dida doy gnaha zi hatna valamu

source: <chevron></chevron>See less
mcn: <chevron></chevron>Mè vul slena gnol di

source: <chevron></chevron>See more
mcn: <chevron></chevron> vul slena gnolo

source: Citation
mcn: Ma sumun dumu

source: Cite with a URL link or the full name of the work.
mcn: Dang zi sama lumna zi slelemu

source: Click
mcn: Rédeng tàni

source: Clips Uploaded
mcn: Hodom hai ìr sumun nongkaf.

source: Comment
mcn: Diguia

source: Contact Us
mcn: Yumaha

source: Continue
mcn: Nigiya

source: Continue validating
mcn: Li tabna mara lō

source: Contribute
mcn: Tabaida

source: Contribute sentences
mcn: Dang dida

source: Contribution Criteria
mcn: Slena ma zigin tuamu

source: Create a profile
mcn: Vulgi slena ma nigi asa luma.

source: Criteria
mcn: Slena ma tabaina

source: Datasets
mcn: Slena ma gnaya

source: Delete my recordings
mcn: Mey tabam di.

source: Different language
mcn: Vun maraha

source: Difficult to pronounce
mcn: Lawam boneyo

source: Discard ongoing recording
mcn: Mè ūh ma nigi tabam di

source: Does the sentence meet the guidelines?
mcn: Dida gnaha na nigi min nala ?

source: Donate your voice
mcn: Vulgi delha vigia nèdè

source: Don't see your language on Common Voice yet?
mcn: Vuna vigia bè wihè?

source: Drag your file here or <uploadButton>click to upload</uploadButton>
mcn: Redeng tāni hai vada nang gnayamū<uploadButton> redeng ala nigi hotkida <uploadButton>

source: Drop file here to upload
mcn: Vulgi slena ma nigi kodomū numa min hodomū

source: Enter your public domain sentence here
mcn: Dong dida ma sumsa ma wum nongkaf

source: Enter your public domain sentences here
mcn: Dong dida ma sumsa ma wum nongkaf

source: Error adding sentence
mcn: Djod ka’a hai dida keynì

source: ESC
mcn: Rumu

source: Exit & Delete clips
mcn: Kaley bey tapna.

source: Fewer than 15 words per sentence
mcn: Dida ken mè asa sū dogo valh di

source: File is too large
mcn: Vada ta gnaya ka gnolo

source: File is too small
mcn: Vada ta gnaya guroyo

source: Finance
mcn: Sugnuna

source: Finish recording
mcn: Vadey tapna.

source: Finish recording first?
mcn: Ta vat tapna duaha ?

source: Finish Review
mcn: Ma nang uhumu vadeya

source: Finish validating
mcn: Vadey zi nimu

source: Finish validating clips?
mcn: Vadeya zi slena ma nigi tabama?

source: Follow guidelines from “What sentences can I add?”
mcn: Uhgid hagad ta neda "dida ma nang asa vul mara ?"

source: for example
mcn: Li ki

source: For technology to work well for everyone, the data that helps developers to build technology needs to reflect a diverse range of people. For example, if we don't include any speakers with a particular accent, then the technology won't work well for people with that accent. <learnMore>Learn more about why metadata matters.</learnMore>
mcn: Ala slena tudi gnaha hai dja nongkaf dida gudmaha hai ina vi va ma redeng zi bàmá numa mè vul slemen vi sumun di ken mudum gnaha <learnMore>Lā nang min wi gnolo hai slen ma redeng zi bàmá.</learnMore>

source: General
mcn: Hai nongkaf

source: General language / multiple variants
mcn: Slena ma nongkaf hai vuna

source: Grammatical / spelling error
mcn: Mè doy gnadi

source: Great!<recordIcon></recordIcon> Record your next clip
mcn: Gna gnōlō ! <recordIcon></recordIcon> Tapna hen ka tudina.

source: Great work!<playIcon></playIcon> Listen again when you're ready
mcn: Lōb lì gnaha !<playcon></playcon> Humgit la nigi as lumu

source: Guidelines
mcn: Ma luma

source: Healthcare
mcn: Donoda

source: Help create Common Voice’s first target segment in { $locale }
mcn: Nigi gudma tunaiy tunda tchoha ta wilida { $locale }

source: Help us validate voices
mcn: Gudmaha ala numa min delha ma tabama

source: His hand was rais-ed.
mcn: Futuna ma lina zi sliwna zi mūlā

source: History, Law and Government
mcn: Slen ma lì djewna, gòmna

source: How do I cite?
mcn: Dekì ma numa asa dumu ?

source: How to add multiple sentences
mcn: Dehki dida maraha ma ni asa vulumu

source: How would you describe your sex or gender?
mcn: Dang la nang goda, la nang djufù.

source: I agree
mcn: Minimu.

source: I confirm that these sentence are <wikipediaLink>public domain</wikipediaLink> and I have permission to upload them.
mcn: Nen wi ala dida ken <wikipediaLink> sumûn wum nongkaf</wikipediaLink> zi ma nen asa hodoma

source: I confirm that this sentence is <wikipediaLink>public domain</wikipediaLink> and I have permission to upload it.
mcn: Nen wi ala dida ken <wikipediaLink> sumûn wum nongkaf</wikipediaLink> zi ma nen asa hodoma

source: <icon></icon> Add multiple public domain sentences
mcn: <icon></icon> Vulgi dida gnolo ma sumun wuma

source: Ideally natural and conversational (it should be easy to read the sentence)
mcn: Min ala dida (kodey gnaha)

source: I do not agree
mcn: Mè mindi.

source: If it’s your own words, just say <italicizedText>“Self Citation”</italicizedText>. We need to know where you found this content so that we can check it is in the public domain and no copyright restrictions apply. For more information about citation see our <guidelinesLink>Guidelines page</guidelinesLink>.
mcn: L ā dum nangnu dang <italicizedText> "dida ma nang lum tuangnu"</italicizedText>. Numa min wi hai vada nang sluma la sumun wum nongkaf la va ta modey maidi . La nigi mi wi gnolo ugit hai <guidelinesLink> ma numa minima </guidelinedLink>

source: If the recording breaks up, or has crackles, reject unless the entirety of the text can still be heard.
mcn: La nang mè hum gnadi hinimu

source: If there is additional information you want to provide about this file, please contact <emailFragment>commonvoice@mozilla.com</emailFragment>
mcn: Lā nigi min vul slena ma nigi wūm ma yigi<emailFragment>commonvoice@mozilla .com</emailFragment>

source: If there is additional information you want to provide about this file that is not included in the template, please contact <emailFragment>commonvoice@mozilla.com</emailFragment>
mcn: La nigi min vul slena ma numa mè wum dina, yigi <emailFragment>commonvoice@mozilla.</emailFragment>

source: If the sentence does not meet the above criteria, click the &quot;Reject&quot; button on the left. If you are unsure about the sentence, you may also skip it and move on to the next one.
mcn: La dida mèy gnadi redeng "minim di" gulu la nang mey widi nang asa hinimu nang digey hai maraha.

source: If the sentence meets the criteria, click the &quot;Approve&quot; button on the right.
mcn: La dida ka gnaha "redeng" ta awa da.

source: If you come across something that these guidelines don’t cover, please vote according to your best judgement. If you really can’t decide, use the skip button and go on to the next recording.
mcn: La nigi zi lawi yigi hai yali vigia , la dono mè tidi redeng digeya . Redeng digeya zi tapna maraha

source: If you run out of sentences to review, please help us collect more sentences!
mcn: La dida mèy gnadi redeng "minim di" gulu la nang mey widi nang asa hinimu nang digey hai maraha !

source: Include appropriate citation
mcn: Vulgi dida ta gnada

source: Invalid file
mcn: Va ma haidi

source: It contains words or phrases that are hard to read or pronounce.
mcn: Dida nam ken hatna valam boneyo

source: It is written in a language different than what I’m reviewing.
mcn: Dida ka’a zi vun ma nen mè wun di.

source: It is written in a language different than what I’m speaking.
mcn: Dida doy zi vun ma nen mè wum di

source: Just Unsure?
mcn: Tuang nari ?

source: Keep it up, record again <recordIcon></recordIcon>
mcn: Tabam nala.

source: Keep the recordings
mcn: Gnayamu.

source: Keep track of your progress with a profile
mcn: Gnrangha tuhna vangnu, kodong hagane ma gnana

source: Language Fundamentals (e.g. Digits, Letters, Money)
mcn: Slena ma vuna (gnamu, sugnuna)

source: Languages
mcn: Vûna

source: Large bulk sentence submission
mcn: Hotkid dida gnolo

source: Learn More
mcn: Wí ngōlō

source: Leaving now means you'll lose your progress
mcn: La nigi kal wilini nigi ma bà.

source: Listen
mcn: Humgiya

source: Listen options menu
mcn: Sli ma "humgia"

source: Loading sentences…
mcn: Op dida ...

source: <loginLink>Login</loginLink> or <loginLink>sign up</loginLink> to add multiple sentences
mcn: <loginLink>Tabang tuagnu</loginLink> <loginLink>dōng tuagnu</loginLink> ala nigi vul dida maraha

source: Log in or sign up to get started
mcn: Tabang tuangnu, dōng tuangnu drà ta tunida

source: Log In / Sign Up
mcn: Tabang tuangnu

source: Make sure the sentence meets the following criteria:
mcn: Uhang la ka zi slen nong kaf :

source: Maximum file size: 25 MB
mcn: Gnran ma hai ma nang gnayam ass dog 25 Mo

source: Media and Entertainment
mcn: Vada ta dì slen na numa mey widi, vada ta liwna

source: Minimum sentences in file: 1000
mcn: Gnran ma dida ma gnaye na ass 1000

source: [Mismatched content]
mcn: [Va ma haidi]

source: Misreadings
mcn: Djoda

source: Missing an <strong>'s'</strong> at the end of a word.
mcn: hai <strong>"s"</strong> mai hai dirama di

source: Missing <strong>'A'</strong> or <strong>'The'</strong> at the beginning of the recording.
mcn: Slena ma <strong>kaini "kep/kepa"</strong> maidi <strong>hai vun di" </strong> ma hai nigi tabam di

source: Missing the end of the last word by cutting off the recording too quickly.
mcn: Nizi hinim bey dirama, slena ma nizi tabama vat kolê

source: [More has been recorded than the required text]
mcn: [Vada tabama gnaiya]

source: Most recordings are of people talking in their natural voice. You can accept the occasional non-standard recording that is shouted, whispered, or obviously delivered in a ‘dramatic’ voice. Please reject sung recordings and those using a computer-synthesized voice.
mcn: Hai tapna slena sumza law zi delha vizia ka’a nigi ass li zinimu mai nigi mè sli delha ma kodey di

source: n
mcn: m

source: N
mcn: M

source: Nature and Environment
mcn: Slena ma hai

source: News and Current Affairs
mcn: Ma wìlìna

source: No
mcn: Mindi

source: [No ‘a’ in the original text]
mcn: [Ma yum "y" mai hai did di]

source: <noCopyright>No copyright</noCopyright> restrictions (cc-0)
mcn: <noCopyright> ma vama nen mè lumdi maidi</noCopyright>(cc0>cc-0)

source: No foreign letters
mcn: Ma mè wumdi maidi

source: No microphone found.
mcn: Mè fi zi vama ma tap delh di.

source: No numbers and special characters
mcn: Ma gnam maidi

source: No sentences to review. <addLink>Add more sentences now!</addLink>
mcn: Did ma duaida maidi nigi as <addLink> vul did maraha</addLink>.

source: No thanks, continue speaking
mcn: Vadi, tabaida lawna.

source: Offensive language
mcn: Dida ma djòho

source: Offensive speech
mcn: Dida ha tang tuangnu

source: On desktop devices you can contribute by downloading…
mcn: Fi vada redeng zi bàmá nang asa mu slena.

source: On his head he wore a beret.
mcn: Vada ki kegen nala ka nir slena

source: On iOS please continue with Safari to enable recording…
mcn: Hai IOS nang asa tabaida zi Safari mā fi tapna.

source: On the other hand, if you think that the reader has probably never come across the word before, and is simply making an incorrect guess at the pronunciation, please reject. If you are unsure, use the skip button.
mcn: La nang wi ala nizi mè wi vadi mai nizi asa lumu hinzia redeng digeya

source: p
mcn: d

source: Partner
mcn: Sumun taptusia

source: [Part of the text can’t be heard]
mcn: Ma nam duma mey humum di

source: <playIcon></playIcon>Last one!
mcn: <playlcon></playlcon> Dirama

source: Play/Stop
mcn: Dangnu/ hinim nalà

source: Please check our <templateFileLink>template file</templateFileLink>. Your sentences should be copyright free (CC0 or permissioned original work by the submitter) and be clear, grammatically correct and easy to read. Submitted sentences should take roughly 10-15 seconds to read and should avoid including numbers, proper nouns and special characters.
mcn: Ūgit <templateFileLink> kìmā</templateFileLink>dida mè zi law di , doy kan gnaha .dida ma nang hodoma asa sli dògò zi dogo yam valh bé gnamna zi slemna

source: Please fill out this field.
mcn: Ôpkida zi vada ta gnana

source: Please select a language to review sentences.
mcn: Deki vun ma nigui duaid dida

source: r
mcn: h

source: [‘Raised’ in English is always pronounced as one syllable, not two]
mcn: [futuna ma lina zi sliwna zi mūlā zi vun francais dum zi dida kêp mèy zì dida ta maah di

source: Rate limit exceeded. Try again in { $retryLimit } minutes
mcn: Hot valam aseya . Hodom lum hai { $retryLimit } ma gnama

source: Rate limit exceeded. Try again in { $retryLimit } seconds
mcn: Hot valam aseya. Hodom lum hai { $retryLimit } ma gnam nèna

source: Reader Effects
mcn: Ma duma ma humuma

source: Reading contractions that aren't actually there, such as "We're" instead of "We are", or vice versa.
mcn: Slena ma numa mè asa dumdi ka’a ki "lali" mu "lali keni"

source: Read Sentences
mcn: Lira dida.

source: Read Sentences, Answer Questions
mcn: Lira dida, hodong vun kalamu.

source: Read Sentences <small>(Coming soon)</small>
mcn: Lira dida <small>(burmaraha)</small>

source: Read sentences submitted by the community in various languages
mcn: Lira dida ma sumun vulgida zi vuna maraha.

source: Ready to do { $count } more?
mcn: Nigi min lumu { $count } gnolo ?

source: <recordIcon></recordIcon> Last one!
mcn: <recordIcon></recordIcon> Hini dirama !

source: [Recording cut off before the end of the last word]
mcn: [Vada nigi tabama rey bey dirama]

source: Record/Stop
mcn: Tabamu/ hinim nala

source: Record yourself reading sentences in your language
mcn: Tabang ma nang ka liramu zi vuna vagnu.

source: Record yourself responding to questions and prompts in your language
mcn: Tabang ma nang ka liramu hodong vun kalamu zi sumun min hum vuna vigia.

source: Record your voice
mcn: Tap delha vagnou

source: Reference the source of your sentence (required)
mcn: Dang hara nang sli dida (vangnu)

source: Reject
mcn: Hinimu

source: Report
mcn: Dékida

source: Report was passed successfully
mcn: Hot delha tchoy gnaha

source: Request a Language
mcn: Vulang vun maraha

source: Re-record
mcn: Tabam lo.

source: Re-record clip
mcn: Tapgi lō

source: Return
mcn: Kalang kalavi

source: Review
mcn: Duaïda

source: Review could not be saved. Please try again later.
mcn: Duaida mè fi tapna di. Lum lō

source: ⓘ Review Criteria
mcn: Slena ma uhumu

source: Review Criteria
mcn: Slena ma uhumu

source: Reviewed sentences not submitted, are sure?
mcn: Dida ma nigi duaida mè tchoydi , nigi min lum lō ?

source: Review existing sentences submitted by the community
mcn: Duaida dida ka’a ma djana vulumu

source: Review & re-record clips here as you go
mcn: Duaida, gnayamu la nigi mina.

source: Review & re-record clips if needed
mcn: Duaida, gnayamu la nigi mina.

source: Review Sentences
mcn: Duaida dida

source: Review sentences in your language
mcn: Duaida dida zi vuna vuna vigia

source: Review & Submit
mcn: Duaida, hotkida.

source: Review transcriptions of recorded sentences for accuracy
mcn: Duaida dida nigi tabama hai dōyna la li gnaha

source: Review user-submitted transcriptions in your language
mcn: Duaida delha ma nigi dōma zi sumsa luma zi vûna vigia

source: s
mcn: l

source: S
mcn: D

source: Select an option
mcn: Vulang vada kep.

source: Select a variant (optional)
mcn: Déhki ta mūdìdā

source: Select File
mcn: Slang ma nang gnayama

source: Select File to Upload
mcn: Slang ma nang min hodoma

source: Select up to three domains (optional)
mcn: Dekì slena hidi

source: Sentence
mcn: Dida

source: Sentence Domain
mcn: Hai dida

source: Sentences contributed here will be added to a publicly available cc-0 licensed dataset.
mcn: Nama ma vul dida vigia ala sumun wun nongkaf

source: { $sentences } sentences reviewed. Thank you!
mcn: { $sentences } Dida duaida. Gigidebè !

source: Sentence Variant
mcn: Dida ta mùdidā

source: Separate sentences into one line by pressing “Enter” or “Return” once
mcn: Mè tap did di redeng "Kalang kalavi"

source: Service and Retail
mcn: Ma vulluma

source: Share Common Voice
mcn: Vulgi Common voice.

source: Share your clip
mcn: Vulgi ma nigi tabama.

source: Shortcuts
mcn: Nèdè

source: [Should be ‘dinosaurs’]
mcn: [Lali mu slena ma fulla nek nala]

source: [Should be “We are”]
mcn: [Asa mu "lali"]

source: Single
mcn: Dida ta kep

source: Single sentence submission
mcn: Hotkid dida kep

source: Skip
mcn: Digeya

source: Small batch
mcn: Nè ma gnaya

source: Small batch sentence submission
mcn: Vulgi dida nèdè

source: Source: { $sentenceSource }
mcn: Hara ma nang sluma : { $sentenceSource }

source: Speak
mcn: Lawa

source: Speak now
mcn: Nigi asa lawa

source: Speak options menu
mcn: Sli ma "Lawa"

source: Start recording
mcn: Fudaï tapna

source: <strong>[Crackle]</strong> giant dinosaurs of <strong>[crackle]</strong> -riassic.
mcn: <stron>[delhem gnolo]</strong>mura ma fulla <strong>[delhem gnolo]</strong>djewna.

source: <strong>[Sneeze]</strong> The giant dinosaurs of the <strong>[cough]</strong> Triassic.
mcn: <strong>[ma issima]</strong>mūra ma fullu<strong>duwayna ]<strong>ma djewna

source: Submit
mcn: Hotkida

source: Submit a new question for the community to read and respond to
mcn: Vulgi djopna maraha ala sumun liramu, nisi hodomu.

source: Submit a report
mcn: Hot delha

source: Submit clips
mcn: Vulgi ma nigi tabama

source: Submit new questions for the community to read and respond to
mcn: Vulgi djoda ta wilida ala djafna asa liramu, hodomu

source: Success
mcn: Li gnaha

source: success checkmark
mcn: Redeng la ka’a vula.

source: Swipe right to approve the sentence. Swipe left to reject it. Swipe up to skip it. <strong>Do not forget to submit your review!</strong>
mcn: Digey gulu la nang min dida .digey djufu la nang mè minim di . Digey guloho la nang mè mindi . <strong>met djok hotkida di !</strong>

source: Taking several attempts to read a word.
mcn: Ligi dida gnōlō

source: Tap
mcn: Rédeng tàni

source: Technology and Robotics
mcn: Vada ta li lob ta sānā nala

source: Thank you for contributing your bulk submission!
mcn: Numa gigi dèbè zi dida nigi vulmana

source: Thank you for contributing your voice!
mcn: Numa gigi dèbè zi delha ma nigi vulmaha.

source: Thank you for donating your voice clips!
mcn: Gigidebè zi delha ma nigi vulma na.

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
mcn: Gigidebe zi slena ma nigi tapna ! <lineBreak></lineBreak> wilin ken nigi asa hotkid gaha.

source: Thank you for your voice information
mcn: Gigidebè zi delha ma nigi vulma na.

source: The bumblebee sped by.
mcn: Yang mè tuni gadi

source: The clip has disrespectful or offensive language.
mcn: Dehla ma nigi tabama djoho

source: The giant dinosaur of the Triassic.
mcn: Vada fulla nek nala ta djewda

source: The giant dinosaurs of the Triassi-.
mcn: Slen ma fullu nizi nek nala ma djewna

source: The giant dinosaurs of the Triassic.
mcn: Slen ma fullu nizi nek nala ma djewna

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
mcn: Mura ma fullu ta djewda.<strong>[hum delha ta kepa]</strong>
